app/controllers/lists_controller.rb

  def index
    @list = List.last
---
SELECT * FROM "lists" ORDER BY lists.id DESC LIMIT 1

  def create
    @list = List.create(params[:list])
---
INSERT INTO "lists" ("created_at", "updated_at", "content") VALUES('2011-03-10 04:21:51', '2011-03-10 04:21:51', 'sdpfok sdfoij sdf')

  def update
    @list = List.create(params[:list])
---
INSERT INTO "lists" ("created_at", "updated_at", "content") VALUES('2011-03-10 04:23:48', '2011-03-10 04:23:48', 'sdpfok sdfoij sdfsdf sdf sdf sf sdoijf sodijf soijf oijsdf soidjf oijsdoifj sijdf